# -*- eval: (require 'ob-shell); -*-
:PROPERTIES:
:ID:       5ac04e2b-1128-4238-80b2-8b0814710be9
:header-args: :eval no :noweb yes
:END:
#+ARCHIVE: ::* Archived

**** symbola
:PROPERTIES:
:ID:       8cd6a8c4-08bc-47aa-ab04-7ad76a181747
:END:

# Manually installed from https://dn-works.com/ufas/

#+begin_src bash :tangle no :dir /sudo::/ :results output
eselect repository enable guru
#+end_src

#+RESULTS:
: Adding guru to /etc/portage/repos.conf/eselect-repo.conf ...
: 1 repositories enabled

Do not enable any other packages from the overlay
#+begin_src conf :tangle /sudo::/etc/portage/package.mask/guru-repo
,*/*::guru
#+end_src
#+begin_src conf :tangle /sudo::/etc/portage/package.unmask/sarasa-mono
media-fonts/symbola::guru
#+end_src

#+begin_src conf :tangle /sudo::/var/lib/portage/world
media-fonts/symbola
#+end_src

**** Sarasa Gothic (for Russian monospaced text)
:PROPERTIES:
:ID:       27b7db4d-bb47-4aa0-8782-244a27d378a2
:END:

[[id:21f06900e232809e79ecdd07e0d84647f30e8975][be5invis [Github] Sarasa-Gothic: Sarasa Gothic /  /  /  /  ]]

#+begin_src bash :tangle no :dir /sudo::/ :results output
eselect repository enable gentoo-zh
#+end_src

#+RESULTS:
: Adding gentoo-zh to /etc/portage/repos.conf/eselect-repo.conf ...
: 1 repositories enabled

Do not enable any other packages from the overlay
#+begin_src conf :tangle /sudo::/etc/portage/package.mask/gentoo-zh-repo
,*/*::gentoo-zh
#+end_src
#+begin_src conf :tangle /sudo::/etc/portage/package.unmask/sarasa-mono
media-fonts/sarasa-gothic::gentoo-zh
#+end_src

#+begin_src conf :tangle /sudo::/var/lib/portage/world
media-fonts/sarasa-gothic
#+end_src

*** =steam=
:PROPERTIES:
:ID:       701aa136-bd29-452e-8d0e-5de963a5e1f6
:END:

[[id:Wiki.Gentoosteam_gentoo_wikic95][[Wiki.Gentoo] Steam - Gentoo Wiki]]

#+begin_src bash :tangle no :dir /sudo::/ :results output :eval yes
eselect repository enable steam-overlay
#+end_src

#+RESULTS:
: Adding steam-overlay to /etc/portage/repos.conf/eselect-repo.conf ...
: 1 repositories enabled

Do not enable any other packages from the overlay
#+begin_src conf :tangle /sudo::/etc/portage/package.mask/steam-overlay-repo
,*/*::steam-overlay
#+end_src

#+begin_src conf :tangle /sudo::/etc/portage/package.unmask/steam-launcher
games-util/steam-launcher::steam-overlay
#+end_src 

#+begin_src conf :tangle /sudo::/var/lib/portage/world
games-util/steam-launcher
#+end_src

#+begin_src conf :tangle /sudo::/etc/portage/package.license/steam-launcher
games-util/steam-launcher ValveSteamLicense
#+end_src

#+begin_src conf :tangle /sudo::/etc/portage/package.accept_keywords/steam-launcher
games-util/steam-launcher ~amd64
#+end_src

